package de.telran.lesson11;

public class SimpleIf {
    public static void main(String[] args) {
        int num = 10;
        if (num>=15){
            System.out.println("I am in if");
        }
        System.out.println("I am Not in if");

    }
}
//Создайте и инициализируйте переменную int = 10
//В блоке if сравните созданную переменную со значением 15
//После блока добавьте инструкцию System.out.println("I am Not in if");
//Проанализируйте вывод